2021.06.08.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2021.06.01.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2021.06.15.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of June 01 to 08, 2021.

#+TOC: headlines 1


* Boltzgen a test generator for teachers
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/boltzgen-a-test-generator-for-teachers/7944/1

** benoitbarbot announced


Boltzgen a test generator for teachers.

I am pleased to introduce https://git.lacl.fr/barbot/boltzgen; Boltzgen: Boltzmann sampler test generator is a tool to generate tests. Given a function signature it generates a random set
of call of this function on generated random input. Inputs are generated using a Boltzmann sampler for unlabeled
structure. This project has the following objectives:
- The primary goal was developing automatic grading system for purely functional programming exercises.
- Generate values with as little information as possible in most case only its type, the input by the user should be as small as possible;
- Strong probabilistic guarantee on the uniformity of the sample process thanks to Boltzmann sampler theory.

Given a function specification as a type signature :

#+begin_src ocaml
    type 'a tree =   Empty  | Node of 'a tree * 'a * 'a tree
    val sum: int list tree -> int
#+end_src

Boltzgen returns calls to this function :

#+begin_src ocaml
    sum (Node((Empty,[],(Node((Empty,[(-4); (-2); 6],Empty))))))
    sum (Node(((Node((Empty,[],Empty))),[13],Empty)))
    sum (Node(((Node((Empty,[57],Empty))),[],(Node((Empty,[],(Node((Empty,[],(Node((Empty,[],Empty))))))))))))
    ...
#+end_src

You can try it with a buggy web interface here https://www.lacl.fr/~barbot/boltzgen/.
Or install it with opam and test locally.

This tool was quickly developed during the first COVID 19 lockdown to quickly generate tests for programming
exercise, many bugs remains, comments and contributions are welcome.
      

** Perry E. Metzger asked and benoitbarbot replied


#+begin_quote
Is there a reason that the utility of such a tool should be restricted to teachers? Property based randomized test
systems also need tools like this for real world testing systems, do they not?
#+end_quote

No, they should not be restricted to teachers,
There are some tool in Haskell using the same technique for test generations.
https://hackage.haskell.org/package/boltzmann-samplers

But this utility in particular was built with teaching and automatic grading in mind. When teaching the base of
functional programming, most exercises are writing a well define standalone pure function.

When writing real world code, you often (depending on programming style) have a mutable custom type and function
which interact with this type (ex HashTbl). Generating good test in this setting require additional work (but I have
a few ideas).

For this tool additional developments are required to use it in a testing framework :
 - The tool was written in hast, it probably should be entirely rewritten.
 - Make it more reliable, right now I look at the generated result to make sure everything went right, more users are required !
 - It should be integrated in a testing framework which requires, I think, moving the generation at compile time and not at the execution time, for each type several functions are generated, this generation should be done with ppx_deriving, I need help to do that.
 - The ToDo list should be emptied, in particular I need help for the runtime generation of Ocaml value which requires knowledge in the internal Ocaml representation of value.

The theory of Boltzmann sampling is really beautiful in the fact that abstract math (namely formal power series) are
used in practice to generate quite efficiently discrete value. I believe it could be used for efficient testing in
general.
      



* Benchmark Tooling Engineer Position
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/benchmark-tooling-engineer-position/7955/1

** Celine announced


[[https://tarides.com/][Tarides]] is looking for a [[https://tarides.com/jobs/benchmark-tooling-engineer][Benchmark Tooling Engineer]].

Tarides is a tech start-up founded in Paris in 2018 by pioneers of programming languages and cloud computing. Tarides
develops a software infrastructure platform to deploy secure, distributed applications with strict resource
constraints and low-latency performance requirements. Today, Tarides is composed of a diverse team of 35+ people.

We welcome applications from people of all backgrounds. We strive to create a representative, inclusive and friendly
team, because we know that different experiences, perspectives and backgrounds make for a better workplace.

Please, don’t hesitate to contact me if you have any question, I’ll be more than happy to reply! :slight_smile:
      



* Lightweight OCaml Docker Images created by dune with Multi-Stage Builds
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/lightweight-ocaml-docker-images-created-by-dune-with-multi-stage-builds/7958/1

** Asya-kawai announced


I've written an article of Docker multi-stage Build for lightweight OCaml application using dune.
I refered this article(https://discuss.ocaml.org/t/lightweight-ocaml-docker-images-with-multi-stage-builds/804) and
customized to use dune.

https://github.com/Asya-kawai/blog/blob/main/20210603/how-to-create-minimum-ocaml-docker-image-en.md
      

** Yawar Amin then said


Nice write-up! You can also use opam lockfiles for reproducible builds: https://khady.info/opam-sandbox.html

The main difference in the Dockerfile will be:

#+begin_example
opam install . --deps-only --locked
#+end_example

You won't need to specify the packages in the install command, since they will be in the lockfile.
      



