2021.06.08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-08 Tue 14:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2021.06.01.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2021.06.15.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of June 01 to 08, 2021.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Boltzgen a test generator for teachers</a></li>
<li><a href="#2">Benchmark Tooling Engineer Position</a></li>
<li><a href="#3">Lightweight OCaml Docker Images created by dune with Multi-Stage Builds</a></li>
<li><a href="#4">Runtime Systems Engineer, OCaml Labs (UK) / Tarides (FR) / Segfault Systems (IN) / Remote</a></li>
<li><a href="#5">Timedesc 0.4.0 - date time handling library</a></li>
<li><a href="#6">serialization of closures</a></li>
<li><a href="#7">OCaml compiler development newsletter, issue 2: May 2021</a></li>
<li><a href="#8">OCaml 4.13.0, first alpha release</a></li>
<li><a href="#9">Spin 0.8.0</a></li>
<li><a href="#10">vec 0.3.0</a></li>
<li><a href="#11">First release of line_oriented</a></li>
<li><a href="#org7029f72">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Boltzgen a test generator for teachers</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/boltzgen-a-test-generator-for-teachers/7944/1">https://discuss.ocaml.org/t/boltzgen-a-test-generator-for-teachers/7944/1</a>
</p>
</div>

<div id="outline-container-org90501a2" class="outline-3">
<h3 id="org90501a2">benoitbarbot announced</h3>
<div class="outline-text-3" id="text-org90501a2">
<p>
Boltzgen a test generator for teachers.
</p>

<p>
I am pleased to introduce <a href="https://git.lacl.fr/barbot/boltzgen">https://git.lacl.fr/barbot/boltzgen</a>; Boltzgen: Boltzmann sampler test generator is a tool to generate tests. Given a function signature it generates a random set
of call of this function on generated random input. Inputs are generated using a Boltzmann sampler for unlabeled
structure. This project has the following objectives:
</p>
<ul class="org-ul">
<li>The primary goal was developing automatic grading system for purely functional programming exercises.</li>
<li>Generate values with as little information as possible in most case only its type, the input by the user should be as small as possible;</li>
<li>Strong probabilistic guarantee on the uniformity of the sample process thanks to Boltzmann sampler theory.</li>
</ul>

<p>
Given a function specification as a type signature :
</p>

<div class="org-src-container">
<pre class="src src-ocaml">type 'a tree =   Empty  | Node of 'a tree * 'a * 'a tree
val sum: int list tree -&gt; int
</pre>
</div>

<p>
Boltzgen returns calls to this function :
</p>

<div class="org-src-container">
<pre class="src src-ocaml">sum (Node((Empty,[],(Node((Empty,[(-4); (-2); 6],Empty))))))
sum (Node(((Node((Empty,[],Empty))),[13],Empty)))
sum (Node(((Node((Empty,[57],Empty))),[],(Node((Empty,[],(Node((Empty,[],(Node((Empty,[],Empty))))))))))))
...
</pre>
</div>

<p>
You can try it with a buggy web interface here <a href="https://www.lacl.fr/~barbot/boltzgen/">https://www.lacl.fr/~barbot/boltzgen/</a>.
Or install it with opam and test locally.
</p>

<p>
This tool was quickly developed during the first COVID 19 lockdown to quickly generate tests for programming
exercise, many bugs remains, comments and contributions are welcome.
</p>
</div>
</div>


<div id="outline-container-org31ec75b" class="outline-3">
<h3 id="org31ec75b">Perry E. Metzger asked and benoitbarbot replied</h3>
<div class="outline-text-3" id="text-org31ec75b">
<blockquote>
<p>
Is there a reason that the utility of such a tool should be restricted to teachers? Property based randomized test
systems also need tools like this for real world testing systems, do they not?
</p>
</blockquote>

<p>
No, they should not be restricted to teachers,
There are some tool in Haskell using the same technique for test generations.
<a href="https://hackage.haskell.org/package/boltzmann-samplers">https://hackage.haskell.org/package/boltzmann-samplers</a>
</p>

<p>
But this utility in particular was built with teaching and automatic grading in mind. When teaching the base of
functional programming, most exercises are writing a well define standalone pure function.
</p>

<p>
When writing real world code, you often (depending on programming style) have a mutable custom type and function
which interact with this type (ex HashTbl). Generating good test in this setting require additional work (but I have
a few ideas).
</p>

<p>
For this tool additional developments are required to use it in a testing framework :
</p>
<ul class="org-ul">
<li>The tool was written in hast, it probably should be entirely rewritten.</li>
<li>Make it more reliable, right now I look at the generated result to make sure everything went right, more users are required !</li>
<li>It should be integrated in a testing framework which requires, I think, moving the generation at compile time and not at the execution time, for each type several functions are generated, this generation should be done with ppx_deriving, I need help to do that.</li>
<li>The ToDo list should be emptied, in particular I need help for the runtime generation of Ocaml value which requires knowledge in the internal Ocaml representation of value.</li>
</ul>

<p>
The theory of Boltzmann sampling is really beautiful in the fact that abstract math (namely formal power series) are
used in practice to generate quite efficiently discrete value. I believe it could be used for efficient testing in
general.
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Benchmark Tooling Engineer Position</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/benchmark-tooling-engineer-position/7955/1">https://discuss.ocaml.org/t/benchmark-tooling-engineer-position/7955/1</a>
</p>
</div>

<div id="outline-container-org578fc1d" class="outline-3">
<h3 id="org578fc1d">Celine announced</h3>
<div class="outline-text-3" id="text-org578fc1d">
<p>
<a href="https://tarides.com/">Tarides</a> is looking for a <a href="https://tarides.com/jobs/benchmark-tooling-engineer">Benchmark Tooling Engineer</a>.
</p>

<p>
Tarides is a tech start-up founded in Paris in 2018 by pioneers of programming languages and cloud computing. Tarides
develops a software infrastructure platform to deploy secure, distributed applications with strict resource
constraints and low-latency performance requirements. Today, Tarides is composed of a diverse team of 35+ people.
</p>

<p>
We welcome applications from people of all backgrounds. We strive to create a representative, inclusive and friendly
team, because we know that different experiences, perspectives and backgrounds make for a better workplace.
</p>

<p>
Please, don’t hesitate to contact me if you have any question, I’ll be more than happy to reply! :slight_smile:
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">Lightweight OCaml Docker Images created by dune with Multi-Stage Builds</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/lightweight-ocaml-docker-images-created-by-dune-with-multi-stage-builds/7958/1">https://discuss.ocaml.org/t/lightweight-ocaml-docker-images-created-by-dune-with-multi-stage-builds/7958/1</a>
</p>
</div>

<div id="outline-container-org1589d61" class="outline-3">
<h3 id="org1589d61">Asya-kawai announced</h3>
<div class="outline-text-3" id="text-org1589d61">
<p>
I've written an article of Docker multi-stage Build for lightweight OCaml application using dune.
I refered this article(<a href="https://discuss.ocaml.org/t/lightweight-ocaml-docker-images-with-multi-stage-builds/804">https://discuss.ocaml.org/t/lightweight-ocaml-docker-images-with-multi-stage-builds/804</a>) and
customized to use dune.
</p>

<p>
<a href="https://github.com/Asya-kawai/blog/blob/main/20210603/how-to-create-minimum-ocaml-docker-image-en.md">https://github.com/Asya-kawai/blog/blob/main/20210603/how-to-create-minimum-ocaml-docker-image-en.md</a>
</p>
</div>
</div>


<div id="outline-container-org2c37224" class="outline-3">
<h3 id="org2c37224">Yawar Amin then said</h3>
<div class="outline-text-3" id="text-org2c37224">
<p>
Nice write-up! You can also use opam lockfiles for reproducible builds: <a href="https://khady.info/opam-sandbox.html">https://khady.info/opam-sandbox.html</a>
</p>

<p>
The main difference in the Dockerfile will be:
</p>

<pre class="example" id="orgc62239b">
opam install . --deps-only --locked
</pre>

<p>
You won't need to specify the packages in the install command, since they will be in the lockfile.
</p>
</div>
</div>
</div>
