2021.06.08.org
* Runtime Systems Engineer, OCaml Labs (UK) / Tarides (FR) / Segfault Systems (IN) / Remote
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/runtime-systems-engineer-ocaml-labs-uk-tarides-fr-segfault-systems-in-remote/7959/1

** KC Sivaramakrishnan announced


*** Multicore OCaml Runtime Systems Engineer

The Multicore OCaml team is hiring a runtime systems engineer to hack on the OCaml compiler. This position is being
advertised jointly by [[https://ocamllabs.io/runtime_systems_engineer.html][OCaml Labs (UK)]], [[https://tarides.com/jobs/runtime-systems-engineer][Tarides
(France)]] and [[https://segfault.systems/runtime_systems_engineer.html][Segfault Systems
(India)]].

**** Multicore OCaml

The [[https://github.com/ocaml-multicore][Multicore OCaml]] project aims to bring native support for scalable
concurrency and shared memory parallelism to the OCaml programming language. At its core, Multicore OCaml extends
OCaml with [[https://arxiv.org/abs/2104.00250][effect handlers]] for expressing scalable concurrency, and a
[[https://arxiv.org/abs/2004.11663][high-performance concurrent garbage collector]] aimed at responsive networked
applications. Multicore OCaml is also the first industrial-strength language to be equipped with [[https://kcsrk.info/papers/pldi18-memory.pdf][an efficient yet
modular memory model]], allowing high-level local program reasoning while
retaining performance. Multicore OCaml is actively being developed and core features are being [[https://github.com/ocaml/ocaml/pulls?q=label%3Amulticore-prerequisite+][upstreamed to
OCaml]].

*** Qualifications & Experience

We are looking for an experienced (3Y+) systems engineer to join our team. Ideally, you will have:

- Excellent knowledge of C programming, parallel programming and Operating Systems.
- Worked on Compilers, Garbage Collectors and other runtime systems.
- Working knowledge of computer architecture and micro-architecture.
- Experience in analysing benchmarks and application performance.
- Track record of building production-quality software.
- Demonstrable open source contributions are a plus, but not required.
- Good communication skills in English; English is the corporate language.
- Experience of working in multidisciplinary teams.

*** Responsibilities

- Design and implement features in the Multicore OCaml runtime system.
- Develop tests and documentation for the Multicore OCaml features.
- Implement parallel benchmarks, analyse and improve the performance of Multicore OCaml programs.
- Submit pull requests to the OCaml programming language on GitHub, and work with the OCaml core team to get the features merged.
- Work with external clients and other teams to gather requirements, develop proposals, design solutions and communicate project statuses.
- Provide technical mentorship to other developers on the team.
- Communicate with the wider open-source community (discuss, blog posts, meetups, conferences, talks, etc.).

*** What we offer

- Competitive pay and benefits package.
- Flexible working hours and the possibility to work remotely within the UK / France / India.
- Supportive team environment with experienced Technical and Team Leads.
- The opportunity to grow with a fast-growing company.

*** Apply

- *OCaml Labs (UK)*: Please send your CV and cover letter to *jobs@ocamllabs.io*.
- *Tarides (France)*: Please send your CV and cover letter to *apply@tarides.com*.
- *Segfault Systems (India)*: Please send your CV and cover letter to *jobs@segfault.systems*.

If shortlisted, you will have three online interviews starting with a general interview, followed by a technical
interview, and finally an interview with the team.

We welcome applications from people of all backgrounds. We strive to create a representative, inclusive and friendly
team because we know that different experiences, perspectives and backgrounds make for a better workplace.
      



* Timedesc 0.4.0 - date time handling library
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-timedesc-0-4-0-date-time-handling-library/7962/1

** Darren announced


I'm pleased to announce the release of [[https://github.com/daypack-dev/timere][Timedesc]] 0.4.0.

Timedesc provides utilities to describe points of time, and properly handle calendar and time zone information.

Tutorial and API doc can be found [[https://daypack-dev.github.io/timere/timedesc/Timedesc/index.html][here]].

*** Features
- Timestamp and date time handling with platform independent time zone support
  - Subset of the IANA time zone database is built into this library
- Supports Gregorian calendar date, ISO week date, and ISO ordinal date
- Supports nanosecond precision
- ISO8601 parsing and RFC3339 printing

*** Major changes since 0.1.0

- Added ~ceil~, ~floor~, and ~round~ to ~Timedesc.Span~
- Better support for second fraction for non-RFC3339 pretty printers
  - This includes automatic deduction of smallest number of fractional digits required for lossless representation, previously only used for RFC3339 pretty printers (see ~{sec-frac:c}~ [[https://daypack-dev.github.io/timere/timedesc/Timedesc/index.html#pretty-printing][description]])
- Added ~Timedesc.Zoneless~ module for better time zone-less date time support
- Added ~compare_chrono_min~, ~compare_chrono_max~, and ~compare_struct~ for comparing ~Timedesc.t~ values
      



* serialization of closures
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://sympa.inria.fr/sympa/arc/caml-list/2021-06/msg00003.html

** Christophe Raffalli asked


I just noticed that in 4.12+effect, in the road to multicore, we have now the
nice exception:

#+begin_src ocaml
  Failure("Serializing closures is broken in multicore")
#+end_src

This is a bit a pity: if you want to use both multicore and multi-machine
parallelism, then, marshalling closures was useful for communication between
machines in some cases. Is it a final decision or serialization of closures will
be lost forever in OCaml ?

Remark: Closures is not marked as obsolete in Marshal.mli
      

