2021.06.08.html




<div id="outline-container-4" class="outline-2">
<h2 id="4">Runtime Systems Engineer, OCaml Labs (UK) / Tarides (FR) / Segfault Systems (IN) / Remote</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/runtime-systems-engineer-ocaml-labs-uk-tarides-fr-segfault-systems-in-remote/7959/1">https://discuss.ocaml.org/t/runtime-systems-engineer-ocaml-labs-uk-tarides-fr-segfault-systems-in-remote/7959/1</a>
</p>
</div>

<div id="outline-container-org36e9eb0" class="outline-3">
<h3 id="org36e9eb0">KC Sivaramakrishnan announced</h3>
<div class="outline-text-3" id="text-org36e9eb0">
</div>
<div id="outline-container-orgadda57b" class="outline-4">
<h4 id="orgadda57b">Multicore OCaml Runtime Systems Engineer</h4>
<div class="outline-text-4" id="text-orgadda57b">
<p>
The Multicore OCaml team is hiring a runtime systems engineer to hack on the OCaml compiler. This position is being
advertised jointly by <a href="https://ocamllabs.io/runtime_systems_engineer.html">OCaml Labs (UK)</a>, <a href="https://tarides.com/jobs/runtime-systems-engineer">Tarides
(France)</a> and <a href="https://segfault.systems/runtime_systems_engineer.html">Segfault Systems
(India)</a>.
</p>
</div>

<div id="outline-container-org17b1cdf" class="outline-5">
<h5 id="org17b1cdf">Multicore OCaml</h5>
<div class="outline-text-5" id="text-org17b1cdf">
<p>
The <a href="https://github.com/ocaml-multicore">Multicore OCaml</a> project aims to bring native support for scalable
concurrency and shared memory parallelism to the OCaml programming language. At its core, Multicore OCaml extends
OCaml with <a href="https://arxiv.org/abs/2104.00250">effect handlers</a> for expressing scalable concurrency, and a
<a href="https://arxiv.org/abs/2004.11663">high-performance concurrent garbage collector</a> aimed at responsive networked
applications. Multicore OCaml is also the first industrial-strength language to be equipped with <a href="https://kcsrk.info/papers/pldi18-memory.pdf">an efficient yet
modular memory model</a>, allowing high-level local program reasoning while
retaining performance. Multicore OCaml is actively being developed and core features are being <a href="https://github.com/ocaml/ocaml/pulls?q=label%3Amulticore-prerequisite+">upstreamed to
OCaml</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org9abe71d" class="outline-4">
<h4 id="org9abe71d">Qualifications &amp; Experience</h4>
<div class="outline-text-4" id="text-org9abe71d">
<p>
We are looking for an experienced (3Y+) systems engineer to join our team. Ideally, you will have:
</p>

<ul class="org-ul">
<li>Excellent knowledge of C programming, parallel programming and Operating Systems.</li>
<li>Worked on Compilers, Garbage Collectors and other runtime systems.</li>
<li>Working knowledge of computer architecture and micro-architecture.</li>
<li>Experience in analysing benchmarks and application performance.</li>
<li>Track record of building production-quality software.</li>
<li>Demonstrable open source contributions are a plus, but not required.</li>
<li>Good communication skills in English; English is the corporate language.</li>
<li>Experience of working in multidisciplinary teams.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb02d73d" class="outline-4">
<h4 id="orgb02d73d">Responsibilities</h4>
<div class="outline-text-4" id="text-orgb02d73d">
<ul class="org-ul">
<li>Design and implement features in the Multicore OCaml runtime system.</li>
<li>Develop tests and documentation for the Multicore OCaml features.</li>
<li>Implement parallel benchmarks, analyse and improve the performance of Multicore OCaml programs.</li>
<li>Submit pull requests to the OCaml programming language on GitHub, and work with the OCaml core team to get the features merged.</li>
<li>Work with external clients and other teams to gather requirements, develop proposals, design solutions and communicate project statuses.</li>
<li>Provide technical mentorship to other developers on the team.</li>
<li>Communicate with the wider open-source community (discuss, blog posts, meetups, conferences, talks, etc.).</li>
</ul>
</div>
</div>

<div id="outline-container-org4f7af75" class="outline-4">
<h4 id="org4f7af75">What we offer</h4>
<div class="outline-text-4" id="text-org4f7af75">
<ul class="org-ul">
<li>Competitive pay and benefits package.</li>
<li>Flexible working hours and the possibility to work remotely within the UK / France / India.</li>
<li>Supportive team environment with experienced Technical and Team Leads.</li>
<li>The opportunity to grow with a fast-growing company.</li>
</ul>
</div>
</div>

<div id="outline-container-org5201478" class="outline-4">
<h4 id="org5201478">Apply</h4>
<div class="outline-text-4" id="text-org5201478">
<ul class="org-ul">
<li><b>OCaml Labs (UK)</b>: Please send your CV and cover letter to <b>jobs@ocamllabs.io</b>.</li>
<li><b>Tarides (France)</b>: Please send your CV and cover letter to <b>apply@tarides.com</b>.</li>
<li><b>Segfault Systems (India)</b>: Please send your CV and cover letter to <b>jobs@segfault.systems</b>.</li>
</ul>

<p>
If shortlisted, you will have three online interviews starting with a general interview, followed by a technical
interview, and finally an interview with the team.
</p>

<p>
We welcome applications from people of all backgrounds. We strive to create a representative, inclusive and friendly
team because we know that different experiences, perspectives and backgrounds make for a better workplace.
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">Timedesc 0.4.0 - date time handling library</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-timedesc-0-4-0-date-time-handling-library/7962/1">https://discuss.ocaml.org/t/ann-timedesc-0-4-0-date-time-handling-library/7962/1</a>
</p>
</div>

<div id="outline-container-org775d608" class="outline-3">
<h3 id="org775d608">Darren announced</h3>
<div class="outline-text-3" id="text-org775d608">
<p>
I'm pleased to announce the release of <a href="https://github.com/daypack-dev/timere">Timedesc</a> 0.4.0.
</p>

<p>
Timedesc provides utilities to describe points of time, and properly handle calendar and time zone information.
</p>

<p>
Tutorial and API doc can be found <a href="https://daypack-dev.github.io/timere/timedesc/Timedesc/index.html">here</a>.
</p>
</div>

<div id="outline-container-org96a48fe" class="outline-4">
<h4 id="org96a48fe">Features</h4>
<div class="outline-text-4" id="text-org96a48fe">
<ul class="org-ul">
<li>Timestamp and date time handling with platform independent time zone support
<ul class="org-ul">
<li>Subset of the IANA time zone database is built into this library</li>
</ul></li>
<li>Supports Gregorian calendar date, ISO week date, and ISO ordinal date</li>
<li>Supports nanosecond precision</li>
<li>ISO8601 parsing and RFC3339 printing</li>
</ul>
</div>
</div>

<div id="outline-container-org1902dbf" class="outline-4">
<h4 id="org1902dbf">Major changes since 0.1.0</h4>
<div class="outline-text-4" id="text-org1902dbf">
<ul class="org-ul">
<li>Added <code>ceil</code>, <code>floor</code>, and <code>round</code> to <code>Timedesc.Span</code></li>
<li>Better support for second fraction for non-RFC3339 pretty printers
<ul class="org-ul">
<li>This includes automatic deduction of smallest number of fractional digits required for lossless representation, previously only used for RFC3339 pretty printers (see <code>{sec-frac:c}</code> <a href="https://daypack-dev.github.io/timere/timedesc/Timedesc/index.html#pretty-printing">description</a>)</li>
</ul></li>
<li>Added <code>Timedesc.Zoneless</code> module for better time zone-less date time support</li>
<li>Added <code>compare_chrono_min</code>, <code>compare_chrono_max</code>, and <code>compare_struct</code> for comparing <code>Timedesc.t</code> values</li>
</ul>
</div>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">serialization of closures</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2021-06/msg00003.html">https://sympa.inria.fr/sympa/arc/caml-list/2021-06/msg00003.html</a>
</p>
</div>

<div id="outline-container-orgb603693" class="outline-3">
<h3 id="orgb603693">Christophe Raffalli asked</h3>
<div class="outline-text-3" id="text-orgb603693">
<p>
I just noticed that in 4.12+effect, in the road to multicore, we have now the
nice exception:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">Failure("Serializing closures is broken in multicore")
</pre>
</div>

<p>
This is a bit a pity: if you want to use both multicore and multi-machine
parallelism, then, marshalling closures was useful for communication between
machines in some cases. Is it a final decision or serialization of closures will
be lost forever in OCaml ?
</p>

<p>
Remark: Closures is not marked as obsolete in Marshal.mli
</p>
</div>
</div>
