2021.06.08.org
** Xavier Leroy replied


I was not aware of this limitation of Multicore OCaml, and looking at its
git history, it looks like it was introduced very early in the development,
perhaps to make things simpler initially.

Marshalling of function closures has always been sort of experimental and
not super reliable, but I was not expecting it to be incompatible with
Multicore OCaml.  We (the core dev team) will sort it out.
      



* OCaml compiler development newsletter, issue 2: May 2021
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-2-may-2021/7965/1

** gasche announced


I’m happy to publish the second issue of the “OCaml compiler development newsletter”. (This is by no means
exhaustive: many people didn’t end up having the time to write something, and it’s fine.)

Feel free of course to comment or ask questions!

If you have been working on the OCaml compiler and want to say something, please feel free to post in this thread! If
you would like me to get in touch next time I prepare a newsletter issue (some random point in the future), please
let me know by email at (gabriel.scherer at gmail).

Previous issue:
- [[https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-1-before-may-2021/7831][OCaml compiler development newsletter, issue 1: before May 2021]]

*** Gabriel Scherer and Nicolas Chataing (@gasche and @nchataing)

[Gabriel writing] my main recent compiler-related activity is ongoing work with my intern Nicolas Chataing to
implement a prototype of variant constructor unboxing, a core subset of what Jeremy Yallop proposed (
https://github.com/ocaml/RFCs/pull/14 ). Currently OCaml can "unbox" a variant if it has a single constructor (with a
single parameter),

#+begin_src ocaml
    type t = Int of int [@@unboxed]
#+end_src

Jeremy's idea is to support the case where there are other constructors, but the tag (immediate value or block
constructor tag) of the constructor parameter is disjoint from the tag of any other value at this type.

#+begin_src ocaml
    type t = Short of int [@unboxed] | Long of Mpz.t
#+end_src

Nicolas' prototype implementation is going along nicely, with some interesting challenges encountered and solved, and
a few refactoring PRs along the way (#[[https://github.com/ocaml/ocaml/issues/10307][10307]],
#[[https://github.com/ocaml/ocaml/issues/10412][10412]], #[[https://github.com/ocaml/ocaml/issues/10428][10428]]).

A key ingredient is to be able to compute the "head shape" of an OCaml type, an over-approximation of the set of
possible tags of its values. We hit a few engineering and research issues in doing this. Where in the codebase should
this be computed (beware of circular module dependencies)? Can we compute this information in a precise way in
presence of mutually-recursive types, without risking non-termination?

We are taking inspiration from a general approach proposed by Leo White and Stephen Dolan to compute these kind of
"type declaration properties" on-demand instead of as part of the type declaration's signature (see their proposal
for "immediacy" at #[[https://github.com/ocaml/ocaml/pull/10017][10017]],
#[[https://github.com/ocaml/ocaml/pull/10041][10041]] ), but our property is demanded more often (any occurrence of the
constructor) and is more fine-grained (it is sensitive to type parameters), so we had to invent some solutions for
new problems. (A close cousin is ~get_unboxed_type_representation~, which avoids non-termination by using fuel, and
we wanted something nicer than that.)

We discuss our handling of termination in (some) details in the following short abstract: [[http://gallium.inria.fr/~scherer/research/constructor-unboxing/constructor-unboxing-ml-workshop-2021.pdf][Unfolding ML datatype
definitions without
loops]].

*** Xavier Leroy (@xavierleroy)

I worked with Damien Doligez and Sadiq Jaffer on the "safe points" proposal
(#[[https://github.com/ocaml/ocaml/issues/10039][10039]]), which is required to move forward with integrating Multicore
OCaml.  I re-expressed the static analyses that support the insertion of polls as backward dataflow analyses, making
them simpler to understand and more robust.  We also discussed whether to insert polls at the top of loops or at the
bottom.  Both strategies are implemented in the current state of the PR, and Sadiq is currently benchmarking them.

All this rekindled my interest in dataflow analyses.  I wrote a generic backward dataflow analyzer, parameterized by
an abstract domain and a transfer function (#[[https://github.com/ocaml/ocaml/issues/10404][10404]]).  Originally I
intended to use it only for the insertion of polls, but I also used it to reimplement the liveness analysis that
plays a crucial role for register allocation and dead code elimination.  A problem with the old liveness analysis is
that it takes time exponential in the nesting of loops.  The new generic analyzer avoids this pitfall by starting
fixpoint iterations not systematically at the bottom of the abstract domain, but at the fixpoint found earlier, if
any.  This makes liveness analysis linear in the nesting of loops, and at worst cubic in the size of the function,
instead of exponential.

Then I applied the same trick to the two passes that insert spills and reloads preventively
(#[[https://github.com/ocaml/ocaml/issues/10414][10414]]).  These are "analyze and simultaneously transform" passes, so
I could not use the generic dataflow analyzer, but I could reuse the same improved fixpoint iteration strategy, again
avoiding behaviors exponential in the nesting of loops.  For instance, a trivial function consisting of 16 nested
"for" loops now compiles in a few milliseconds, while it took several seconds before.

