2021.06.08.html


<div id="outline-container-orgf54d3c3" class="outline-3">
<h3 id="orgf54d3c3">Xavier Leroy replied</h3>
<div class="outline-text-3" id="text-orgf54d3c3">
<p>
I was not aware of this limitation of Multicore OCaml, and looking at its
git history, it looks like it was introduced very early in the development,
perhaps to make things simpler initially.
</p>

<p>
Marshalling of function closures has always been sort of experimental and
not super reliable, but I was not expecting it to be incompatible with
Multicore OCaml.  We (the core dev team) will sort it out.
</p>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">OCaml compiler development newsletter, issue 2: May 2021</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-2-may-2021/7965/1">https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-2-may-2021/7965/1</a>
</p>
</div>

<div id="outline-container-orga628f0d" class="outline-3">
<h3 id="orga628f0d">gasche announced</h3>
<div class="outline-text-3" id="text-orga628f0d">
<p>
I’m happy to publish the second issue of the “OCaml compiler development newsletter”. (This is by no means
exhaustive: many people didn’t end up having the time to write something, and it’s fine.)
</p>

<p>
Feel free of course to comment or ask questions!
</p>

<p>
If you have been working on the OCaml compiler and want to say something, please feel free to post in this thread! If
you would like me to get in touch next time I prepare a newsletter issue (some random point in the future), please
let me know by email at (gabriel.scherer at gmail).
</p>

<p>
Previous issue:
</p>
<ul class="org-ul">
<li><a href="https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-1-before-may-2021/7831">OCaml compiler development newsletter, issue 1: before May 2021</a></li>
</ul>
</div>

<div id="outline-container-org5e66434" class="outline-4">
<h4 id="org5e66434">Gabriel Scherer and Nicolas Chataing (@gasche and @nchataing)</h4>
<div class="outline-text-4" id="text-org5e66434">
<p>
[Gabriel writing] my main recent compiler-related activity is ongoing work with my intern Nicolas Chataing to
implement a prototype of variant constructor unboxing, a core subset of what Jeremy Yallop proposed (
<a href="https://github.com/ocaml/RFCs/pull/14">https://github.com/ocaml/RFCs/pull/14</a> ). Currently OCaml can "unbox" a variant if it has a single constructor (with a
single parameter),
</p>

<div class="org-src-container">
<pre class="src src-ocaml">type t = Int of int [@@unboxed]
</pre>
</div>

<p>
Jeremy's idea is to support the case where there are other constructors, but the tag (immediate value or block
constructor tag) of the constructor parameter is disjoint from the tag of any other value at this type.
</p>

<div class="org-src-container">
<pre class="src src-ocaml">type t = Short of int [@unboxed] | Long of Mpz.t
</pre>
</div>

<p>
Nicolas' prototype implementation is going along nicely, with some interesting challenges encountered and solved, and
a few refactoring PRs along the way (#<a href="https://github.com/ocaml/ocaml/issues/10307">10307</a>,
#<a href="https://github.com/ocaml/ocaml/issues/10412">10412</a>, #<a href="https://github.com/ocaml/ocaml/issues/10428">10428</a>).
</p>

<p>
A key ingredient is to be able to compute the "head shape" of an OCaml type, an over-approximation of the set of
possible tags of its values. We hit a few engineering and research issues in doing this. Where in the codebase should
this be computed (beware of circular module dependencies)? Can we compute this information in a precise way in
presence of mutually-recursive types, without risking non-termination?
</p>

<p>
We are taking inspiration from a general approach proposed by Leo White and Stephen Dolan to compute these kind of
"type declaration properties" on-demand instead of as part of the type declaration's signature (see their proposal
for "immediacy" at #<a href="https://github.com/ocaml/ocaml/pull/10017">10017</a>,
#<a href="https://github.com/ocaml/ocaml/pull/10041">10041</a> ), but our property is demanded more often (any occurrence of the
constructor) and is more fine-grained (it is sensitive to type parameters), so we had to invent some solutions for
new problems. (A close cousin is <code>get_unboxed_type_representation</code>, which avoids non-termination by using fuel, and
we wanted something nicer than that.)
</p>

<p>
We discuss our handling of termination in (some) details in the following short abstract: <a href="http://gallium.inria.fr/~scherer/research/constructor-unboxing/constructor-unboxing-ml-workshop-2021.pdf">Unfolding ML datatype
definitions without
loops</a>.
</p>
</div>
</div>

<div id="outline-container-org17fd7b9" class="outline-4">
<h4 id="org17fd7b9">Xavier Leroy (@xavierleroy)</h4>
<div class="outline-text-4" id="text-org17fd7b9">
<p>
I worked with Damien Doligez and Sadiq Jaffer on the "safe points" proposal
(#<a href="https://github.com/ocaml/ocaml/issues/10039">10039</a>), which is required to move forward with integrating Multicore
OCaml.  I re-expressed the static analyses that support the insertion of polls as backward dataflow analyses, making
them simpler to understand and more robust.  We also discussed whether to insert polls at the top of loops or at the
bottom.  Both strategies are implemented in the current state of the PR, and Sadiq is currently benchmarking them.
</p>

<p>
All this rekindled my interest in dataflow analyses.  I wrote a generic backward dataflow analyzer, parameterized by
an abstract domain and a transfer function (#<a href="https://github.com/ocaml/ocaml/issues/10404">10404</a>).  Originally I
intended to use it only for the insertion of polls, but I also used it to reimplement the liveness analysis that
plays a crucial role for register allocation and dead code elimination.  A problem with the old liveness analysis is
that it takes time exponential in the nesting of loops.  The new generic analyzer avoids this pitfall by starting
fixpoint iterations not systematically at the bottom of the abstract domain, but at the fixpoint found earlier, if
any.  This makes liveness analysis linear in the nesting of loops, and at worst cubic in the size of the function,
instead of exponential.
</p>

<p>
Then I applied the same trick to the two passes that insert spills and reloads preventively
(#<a href="https://github.com/ocaml/ocaml/issues/10414">10414</a>).  These are "analyze and simultaneously transform" passes, so
I could not use the generic dataflow analyzer, but I could reuse the same improved fixpoint iteration strategy, again
avoiding behaviors exponential in the nesting of loops.  For instance, a trivial function consisting of 16 nested
"for" loops now compiles in a few milliseconds, while it took several seconds before.
</p>
</div>
</div>
