2021.06.08.html

<div id="outline-container-org50b0f17" class="outline-4">
<h4 id="org50b0f17">Jacques Garrigue (@garrigue)</h4>
<div class="outline-text-4" id="text-org50b0f17">
<p>
No new PR this month, but I have kept working on those that were started in April, and are not yet merged:
</p>

<ul class="org-ul">
<li>#<a href="https://github.com/ocaml/ocaml/issues/10348">10348</a> improves the way expansion is done during unification, to avoid some spurious GADT related ambiguity errors</li>
<li>#<a href="https://github.com/ocaml/ocaml/issues/10364">10364</a> changes the typing of the body of the cases of pattern-matchings, allowing to warn in some non-principal situations; it also uncovered a number of principality related bugs inside the the type-checker</li>
<li>#<a href="https://github.com/ocaml/ocaml/issues/10337">10337</a> enforces that one always manipulate a normalized view of types by making type_expr an abstract type (with Takafumi Saikawa (@t6s))</li>
</ul>

<p>
For this last PR, we have interestingly observed that while this multiplied the number of calls to repr by a factor
of up to 4, resulting in a 4% overhead in stdlib for instance, we could see no performance degradation in the
compilation of Coq.
</p>

<p>
I have also discovered a new principality bug in the implementation of GADTs (see
#<a href="https://github.com/ocaml/ocaml/issues/10348">10348</a> again), which fortunately should not affect soundness.
</p>

<p>
In a slightly different direction, I have started working on a backend targetting Coq:
  <a href="https://github.com/COCTI/ocaml/tree/ocaml_in_coq">https://github.com/COCTI/ocaml/tree/ocaml_in_coq</a>
</p>

<p>
If you add the -coq option to ocamlc, you get a .v file in place of a .cmo.
It is still in a very early stage, only able to compile core ML programs, including references.
The main difference with coq-of-ocaml is that the translation is intended to be soundness preserving: the resulting
Coq code can be typed and evaluated without axioms, and should reduce to the same resut as the source program, so
that the type soudness of Coq underwrites that of ocaml (for individual programs). At this point, it only relies on a
single relaxation of the positivity restriction of Coq.
</p>
</div>
</div>

<div id="outline-container-orgc49c72e" class="outline-4">
<h4 id="orgc49c72e">Thomas Refis (@trefis)</h4>
<div class="outline-text-4" id="text-orgc49c72e">
<p>
Recently, Didier Rémy and I have been looking at <span class="underline">modular explicits</span>, a small extension between the core and module
language to help manipulate first-class functors and give the illusion of abstraction over module arguments in the
core language via a new construct (tentatively) called <span class="underline">dependent functions</span>.
</p>

<p>
This construct was first introduced in the context of the <a href="https://arxiv.org/pdf/1512.01895.pdf">modular implicits</a>
proposal; roughly it's what you're left with if you take away the "resolution of implicit arguments" part of that
proposal.
</p>

<p>
As such, it is a natural stepping stone towards modular implicits and already has its own self-contained PR:
#<a href="https://github.com/ocaml/ocaml/pull/9187">9187</a>, contributed by Matthew Ryan.
</p>

<p>
What Didier and I have been focusing on recently is producing a more formal description of the feature and its
relationship to first-class modules, as well as some arguments to justify that it is reasonable and desirable to add
it to the language, even in the absence of modular implicits.
</p>
</div>
</div>

<div id="outline-container-org48c2a6c" class="outline-4">
<h4 id="org48c2a6c">Stephen Dolan (@stedolan)</h4>
<div class="outline-text-4" id="text-org48c2a6c">
<p>
I've just opened #<a href="https://github.com/ocaml/ocaml/pull/10437">10437</a>, which allows explicit quantifiers for type
variables in signatures and GADTs, a small feature I promised to OCaml maintainers a dozen of months ago. (The
ulterior motive is that these explicit quantifiers give a good place to put layout information, but I think they're
worth having on their own merits).
</p>

<p>
Note: The on-demand immediacy proposal in #<a href="https://github.com/ocaml/ocaml/issues/10017">10017</a> /
#<a href="https://github.com/ocaml/ocaml/issues/10041">10041</a>, which Gabriel mentioned above, is extracted from part of the
kinding system in the experimental branch <a href="https://github.com/janestreet/ocaml/tree/layouts">https://github.com/janestreet/ocaml/tree/layouts</a> , which additionally
allows quantification over types of a given immediacy / layout: for instance, one can write <code>type ('a : immediate) t = { foo : 'a }</code> and have inference, etc. work as expected.
</p>
</div>
</div>

<div id="outline-container-orgeba78e0" class="outline-4">
<h4 id="orgeba78e0">Sadiq Jaffer (@sadiqj)</h4>
<div class="outline-text-4" id="text-orgeba78e0">
<p>
The Safepoints PR #<a href="https://github.com/ocaml/ocaml/pull/10039/">10039</a> has a few updates. It now has a new static
analysis, written by Xavier Leroy and Damien Doligez, and has working code emitters on all 64-bit platforms.
</p>

<p>
The static analysis had some flexibility on poll placement in loops. We've benchmarked on amd64 and arm64, choosing
to go with the option that results in slightly fewer instructions and branches across the Sandmark suite. Short of
some refactoring I don't think there are any other oustanding issues with the PR.
</p>

<p>
Building on safepoints, I should soon have an attribute to propose which will enable users with atomic code blocks to
safely migrate to a version of OCaml with safepoints. A draft PR or RFC will be coming very soon.
</p>

<p>
I am also doing some work on the <a href="https://ocaml.org/releases/4.12/manual/instrumented-runtime.html">instrumented
runtime</a>. One of the project's goals is to be able
to continuously monitor OCaml applications running in a production environment. To that end I'm evaluating the
instrumented runtime's performance overhead (both enabled and not), determining what work would be required to
reduced the overhead and how we could modify the runtime to continuously extract metrics and events.
</p>
</div>
</div>

<div id="outline-container-org36664f5" class="outline-4">
<h4 id="org36664f5">Anil Madhavapeddy (@avsm)</h4>
<div class="outline-text-4" id="text-org36664f5">
<p>
Ewan Mellor and I are working on a CI that'll make it easy to test individual changesets to the OCaml compiler and
run "reverse dependencies" against a set of opam packages to isolate precisely what's causing a failure.
</p>

<p>
A failure to build an opam package can come from a variety of reasons. This can range from a build failure against a
stable released compiler, to a failure on just OCaml trunk (but success on a released compiler), to a failure just on
OCaml trunk + the PR in question.  It's the triage of which of these situations is causing the package build failure
that our new CI focusses on. Having this CI should let us quickly determine a PR's impact and potential regressions
on the package ecosystem. Once the CI is stable on the OCaml multicore trees, I plan to submit it as a CI to run
against mainline OCaml as well.
</p>

<p>
The working tree is at <a href="https://github.com/ocurrent/ocaml-multicore-ci">ocaml-multicore-ci</a> (although it's called a
"multicore CI", its really just turned into an "ocaml-compiler-ci" and we will rename the repository before a first
release).
</p>
</div>
</div>
