2021.06.08.org
*** Florian Angeletti (@Octachron)

This week I have been working a bit on adding swaps and moves to the diffing based error messages for type
declarations in #[[https://github.com/ocaml/ocaml/pull/10361][10361]].

(And the release of the first alpha for OCaml 4.13.0)

The core idea of the PR is that when comparing
#+begin_src ocaml
type t = { a:int; b:int; c:int; d:int }
#+end_src
with
#+begin_src ocaml
type t = { a:int; c:int; d:int }
#+end_src
in an error message, it is better to notice that we are missing one field rather than trying to compare the fields
~b~ and ~c~.

And with the machinery introduced for functor diffing, this is quite straigthforward to implement. I have been
experimenting with this option since last december, and with the functor diffing PR merged
#[[https://github.com/ocaml/ocaml/issues/9331][9331]], I proposed a PR
#[[https://github.com/ocaml/ocaml/issues/10361][10361]] in April.

However, compared to functors, in type declarations, we have have one supplementary piece of information: the name of
fields and constructors at a given position.  Not using this piece of information yields slightly akward error
messages:

#+begin_src ocaml
  module M: sig type t = { a:int; b:int } end = struct type t = {b:int; a:int} end
#+end_src
#+begin_example
   1. Fields have different names, a and b.
   2. Fields have different names, b and a.
#+end_example
Here, it would be better to recognize that the two fields have been swapped.

One simple way to do this without increasing the diffing complexity is to identify swaps at posteriori on the optimal
patch produced by the diffing algorithm.

In this way we can replace the previous error message by
#+begin_example
   1<->2. Fields a and b have been swapped.
#+end_example
without increasing the cost of the error analysis.

A similar situation happens when the position of a field changes between the interface and the implementation
#+begin_src ocaml
module M: sig
   type t = { a:unit; b:int; c:float}
end = struct
   type t = { b:int; c:float; a:unit}
end
#+end_src

Explaining that the implementation can be transformed into the interface by adding a field ~a~ before the field ~b~
and deleting another field ~a~ after ~c~ is correct. But it is much nicer to sum up the issue as
#+begin_example
1->3. Field a has been moved from position 1 to 3
#+end_example
Both composite moves are now recognized.

People interested by error message in OCaml should also have a look at the great work by Antal Spector-Zabusky in
#[[https://github.com/ocaml/ocaml/pull/10407][10407]] to improve the module level error message by expanding them with
a full error trace.
(The two PRs are quite complementary.)
      

** Frédéric Recoules asked and gasche replied


#+begin_quote
Thank you @gasche and all the authors, these posts are really interesting!

I am looking forward to see all of this in the compiler, especially the work of @nchataing :upside_down_face:

Just reacting to the example, it would be nice if you can tag the type ~Mpz.t~ with ~[@custom]~ + ~[@unboxed]~ (is
there a syntax to add multiple annotation?) because ~custom~ (hat, c.f. [[http://gallium.inria.fr/~scherer/research/constructor-unboxing/constructor-unboxing-ml-workshop-2021.pdf][Unfolding ML datatype definitions without
loops]] is
distinguishable of ~int~ (hat and all other tag too).
#+end_quote

One issue with ~custom~ tags is that they are currently only visible on the C side, the OCaml type is opaque, so the
~[@custom]~ annotation would have to be trusted by the compiler, which is meh. But the feature would be a special
case of allowing shape restrictions on abstract types; which makes perfect sense.
      

** Rudi Grinberg asked and octachron replied


#+begin_quote
@octachron the progress in improving error messages is an exciting development. Thanks!

Is there any work to improve error messages for consumption by other tools? I know there's the json effort, but it
seems to have been stalled. What about improving the compiler api to use the ~sub~ field for sub messages more
consistently. This would greatly improve the presentation of errors to the user in lsp/merlin.
#+end_quote

The json work for the error metadata was temporally stopped to ensure that it was still compatible with Merlin, but I
am planning to get back to in for 4.14 . Also I would be quite keen to discuss potential use cases to ensure that the
produced json is useful for tools.

Concerning, error submessages, I didn't know that lsp/merlin was using them successfully. But yes, if there is such
an use case, it would help motivate a more consistent use of submessages in the compiler. Note that as an experiment,
the new functor diffing error message in 4.13.0 already uses suberror messages in the functor application case.
However, for functors (and any module level error really), a tree structure would have been more natural than a list
of submessages at least from the producer side. I would expect that tools could also benefit from such a tree of
error messages, but this seems worth discussing in term of design.
      

** Rudi Grinberg then said


A tree structure sounds like the right thing to do conceptually. But at least in lsp, errors are permitted to have a
flat list of "related" messages with locations. That fits the current data error data structure used by OCaml. If a
tree was used, I would probably have to flatten it anyways.
      



* OCaml 4.13.0, first alpha release
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/ocaml-4-13-0-first-alpha-release/7967/1

** octachron announced


Three months after the release of OCaml 4.12.0, the set of new features for the future version 4.13.0 of OCaml has
been frozen. I am thus happy to announce the first alpha release for OCaml 4.13.0 .

This alpha version is here to help fellow hackers join us early in our bug hunting and opam ecosystem fixing fun (see
below for the installation instructions). You can see the progress on this front at

https://github.com/ocaml/opam-repository/issues/18791

If you find any bugs, please report them here:
https://github.com/ocaml/ocaml/issues

Once most major OCaml tools are supported, we will switch to beta releases.
The full release is expected to happen in September.

If you are interested by the ongoing list of new features and bug fixes, the
updated change log for OCaml 4.13.0 is available at:

https://github.com/ocaml/ocaml/blob/4.13/Changes

Note that there is still some on-going work to support improved polling points in preparation
for OCaml multicore. Another alpha release will be published once this work is merged.

