2021.06.08.html

<div id="outline-container-orgcc67484" class="outline-4">
<h4 id="orgcc67484">Florian Angeletti (@Octachron)</h4>
<div class="outline-text-4" id="text-orgcc67484">
<p>
This week I have been working a bit on adding swaps and moves to the diffing based error messages for type
declarations in #<a href="https://github.com/ocaml/ocaml/pull/10361">10361</a>.
</p>

<p>
(And the release of the first alpha for OCaml 4.13.0)
</p>

<p>
The core idea of the PR is that when comparing
</p>
<div class="org-src-container">
<pre class="src src-ocaml">type t = { a:int; b:int; c:int; d:int }
</pre>
</div>
<p>
with
</p>
<div class="org-src-container">
<pre class="src src-ocaml">type t = { a:int; c:int; d:int }
</pre>
</div>
<p>
in an error message, it is better to notice that we are missing one field rather than trying to compare the fields
<code>b</code> and <code>c</code>.
</p>

<p>
And with the machinery introduced for functor diffing, this is quite straigthforward to implement. I have been
experimenting with this option since last december, and with the functor diffing PR merged
#<a href="https://github.com/ocaml/ocaml/issues/9331">9331</a>, I proposed a PR
#<a href="https://github.com/ocaml/ocaml/issues/10361">10361</a> in April.
</p>

<p>
However, compared to functors, in type declarations, we have have one supplementary piece of information: the name of
fields and constructors at a given position.  Not using this piece of information yields slightly akward error
messages:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">module M: sig type t = { a:int; b:int } end = struct type t = {b:int; a:int} end
</pre>
</div>
<pre class="example" id="orgb3f52ee">
1. Fields have different names, a and b.
2. Fields have different names, b and a.
</pre>
<p>
Here, it would be better to recognize that the two fields have been swapped.
</p>

<p>
One simple way to do this without increasing the diffing complexity is to identify swaps at posteriori on the optimal
patch produced by the diffing algorithm.
</p>

<p>
In this way we can replace the previous error message by
</p>
<pre class="example" id="org4b9a3d9">
1&lt;-&gt;2. Fields a and b have been swapped.
</pre>
<p>
without increasing the cost of the error analysis.
</p>

<p>
A similar situation happens when the position of a field changes between the interface and the implementation
</p>
<div class="org-src-container">
<pre class="src src-ocaml">module M: sig
   type t = { a:unit; b:int; c:float}
end = struct
   type t = { b:int; c:float; a:unit}
end
</pre>
</div>

<p>
Explaining that the implementation can be transformed into the interface by adding a field <code>a</code> before the field <code>b</code>
and deleting another field <code>a</code> after <code>c</code> is correct. But it is much nicer to sum up the issue as
</p>
<pre class="example" id="orgeb6b837">
1-&gt;3. Field a has been moved from position 1 to 3
</pre>
<p>
Both composite moves are now recognized.
</p>

<p>
People interested by error message in OCaml should also have a look at the great work by Antal Spector-Zabusky in
#<a href="https://github.com/ocaml/ocaml/pull/10407">10407</a> to improve the module level error message by expanding them with
a full error trace.
(The two PRs are quite complementary.)
</p>
</div>
</div>
</div>


<div id="outline-container-orge0c8f6d" class="outline-3">
<h3 id="orge0c8f6d">Frédéric Recoules asked and gasche replied</h3>
<div class="outline-text-3" id="text-orge0c8f6d">
<blockquote>
<p>
Thank you @gasche and all the authors, these posts are really interesting!
</p>

<p>
I am looking forward to see all of this in the compiler, especially the work of @nchataing :upside_down_face:
</p>

<p>
Just reacting to the example, it would be nice if you can tag the type <code>Mpz.t</code> with <code>[@custom]</code> + <code>[@unboxed]</code> (is
there a syntax to add multiple annotation?) because <code>custom</code> (hat, c.f. <a href="http://gallium.inria.fr/~scherer/research/constructor-unboxing/constructor-unboxing-ml-workshop-2021.pdf">Unfolding ML datatype definitions without
loops</a> is
distinguishable of <code>int</code> (hat and all other tag too).
</p>
</blockquote>

<p>
One issue with <code>custom</code> tags is that they are currently only visible on the C side, the OCaml type is opaque, so the
<code>[@custom]</code> annotation would have to be trusted by the compiler, which is meh. But the feature would be a special
case of allowing shape restrictions on abstract types; which makes perfect sense.
</p>
</div>
</div>


<div id="outline-container-org2a22ffc" class="outline-3">
<h3 id="org2a22ffc">Rudi Grinberg asked and octachron replied</h3>
<div class="outline-text-3" id="text-org2a22ffc">
<blockquote>
<p>
@octachron the progress in improving error messages is an exciting development. Thanks!
</p>

<p>
Is there any work to improve error messages for consumption by other tools? I know there's the json effort, but it
seems to have been stalled. What about improving the compiler api to use the <code>sub</code> field for sub messages more
consistently. This would greatly improve the presentation of errors to the user in lsp/merlin.
</p>
</blockquote>

<p>
The json work for the error metadata was temporally stopped to ensure that it was still compatible with Merlin, but I
am planning to get back to in for 4.14 . Also I would be quite keen to discuss potential use cases to ensure that the
produced json is useful for tools.
</p>

<p>
Concerning, error submessages, I didn't know that lsp/merlin was using them successfully. But yes, if there is such
an use case, it would help motivate a more consistent use of submessages in the compiler. Note that as an experiment,
the new functor diffing error message in 4.13.0 already uses suberror messages in the functor application case.
However, for functors (and any module level error really), a tree structure would have been more natural than a list
of submessages at least from the producer side. I would expect that tools could also benefit from such a tree of
error messages, but this seems worth discussing in term of design.
</p>
</div>
</div>


<div id="outline-container-org6a8ed07" class="outline-3">
<h3 id="org6a8ed07">Rudi Grinberg then said</h3>
<div class="outline-text-3" id="text-org6a8ed07">
<p>
A tree structure sounds like the right thing to do conceptually. But at least in lsp, errors are permitted to have a
flat list of "related" messages with locations. That fits the current data error data structure used by OCaml. If a
tree was used, I would probably have to flatten it anyways.
</p>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">OCaml 4.13.0, first alpha release</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-4-13-0-first-alpha-release/7967/1">https://discuss.ocaml.org/t/ocaml-4-13-0-first-alpha-release/7967/1</a>
</p>
</div>

<div id="outline-container-org186f9d7" class="outline-3">
<h3 id="org186f9d7">octachron announced</h3>
<div class="outline-text-3" id="text-org186f9d7">
<p>
Three months after the release of OCaml 4.12.0, the set of new features for the future version 4.13.0 of OCaml has
been frozen. I am thus happy to announce the first alpha release for OCaml 4.13.0 .
</p>

<p>
This alpha version is here to help fellow hackers join us early in our bug hunting and opam ecosystem fixing fun (see
below for the installation instructions). You can see the progress on this front at
</p>

<p>
<a href="https://github.com/ocaml/opam-repository/issues/18791">https://github.com/ocaml/opam-repository/issues/18791</a>
</p>

<p>
If you find any bugs, please report them here:
<a href="https://github.com/ocaml/ocaml/issues">https://github.com/ocaml/ocaml/issues</a>
</p>

<p>
Once most major OCaml tools are supported, we will switch to beta releases.
The full release is expected to happen in September.
</p>

<p>
If you are interested by the ongoing list of new features and bug fixes, the
updated change log for OCaml 4.13.0 is available at:
</p>

<p>
<a href="https://github.com/ocaml/ocaml/blob/4.13/Changes">https://github.com/ocaml/ocaml/blob/4.13/Changes</a>
</p>

<p>
Note that there is still some on-going work to support improved polling points in preparation
for OCaml multicore. Another alpha release will be published once this work is merged.
</p>
</div>
