2021.06.08.html

<div id="outline-container-org5e24c67" class="outline-4">
<h4 id="org5e24c67">Installation instructions</h4>
<div class="outline-text-4" id="text-org5e24c67">
<p>
The base compiler can be installed as an opam switch with the following commands
</p>
<pre class="example" id="org553f9c0">
opam update
opam switch create 4.13.0~alpha1 --repositories=default,beta=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>
<p>
If you want to tweak the configuration of the compiler, you can switch to the option variant with:
</p>
<pre class="example" id="orged54e86">
opam update
opam switch create &lt;switch_name&gt; --packages=ocaml-variants.4.13.0~alpha1+options,&lt;option_list&gt;
--repositories=default,beta=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>
<p>
where &lt;option_list&gt; is a comma separated list of ocaml-option-* packages. For instance, for a flambda and
no-flat-float-array switch:
</p>
<pre class="example" id="org9bc675a">
opam switch create 4.13.0~alpha1+flambda+nffa
--packages=ocaml-variants.4.13.0~alpha1+options,ocaml-option-flambda,ocaml-option-no-flat-float-array
--repositories=default,beta=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>
<p>
All available options can be listed with "opam search ocaml-option".
</p>

<p>
If you want to test this version, it is advised to install the alpha opam repository at
<a href="https://github.com/kit-ty-kate/opam-alpha-repository">https://github.com/kit-ty-kate/opam-alpha-repository</a>
</p>

<p>
with
</p>
<pre class="example" id="org77a8f18">
opam repo add alpha git://github.com/kit-ty-kate/opam-alpha-repository.git
</pre>
<p>
This alpha repository contains various fixes in the process of being upstreamed.
</p>

<p>
The source code for the alpha is also available at these addresses:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/archive/4.13.0-alpha1.tar.gz">https://github.com/ocaml/ocaml/archive/4.13.0-alpha1.tar.gz</a></li>
<li><a href="https://caml.inria.fr/pub/distrib/ocaml-4.13/ocaml-4.13.0~alpha1.tar.gz">https://caml.inria.fr/pub/distrib/ocaml-4.13/ocaml-4.13.0~alpha1.tar.gz</a></li>
</ul>
</div>
</div>
</div>
</div>




<div id="outline-container-9" class="outline-2">
<h2 id="9">Spin 0.8.0</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-spin-0-8-0/7969/1">https://discuss.ocaml.org/t/ann-spin-0-8-0/7969/1</a>
</p>
</div>

<div id="outline-container-orga8e0e16" class="outline-3">
<h3 id="orga8e0e16">Thibaut Mattio announced</h3>
<div class="outline-text-3" id="text-orga8e0e16">
<p>
I'm happy to announce a new version of <code>Spin</code>, the OCaml project generator.
</p>

<p>
This version comes with a lot of improvements. I'm joining the Changelog below, but I'll highlight some of them here.
</p>
</div>

<div id="outline-container-org175bce4" class="outline-4">
<h4 id="org175bce4">Spin as an Opam plugin</h4>
<div class="outline-text-4" id="text-org175bce4">
<p>
This version of Spin is available as an Opam plugin.
</p>

<p>
<code>opam spin new cli</code>, for instance, will generate a new CLI.
</p>
</div>
</div>

<div id="outline-container-orgc613bbb" class="outline-4">
<h4 id="orgc613bbb">The <code>hello</code> command</h4>
<div class="outline-text-4" id="text-orgc613bbb">
<p>
This release comes with a brand new template targetted solely at first-time users.
</p>

<p>
The <code>spin hello</code> command will generate an hello world project where the development setup and directory structure are
explained in the README.
</p>

<p>
Each file are extensively documented, so users can just open any file and learn by example.
</p>

<p>
If you're onboarding new users, I'd be curious what's your experience with <code>opam spin hello</code>!
</p>
</div>
</div>

<div id="outline-container-org1bacdb5" class="outline-4">
<h4 id="org1bacdb5">Simplified templates</h4>
<div class="outline-text-4" id="text-org1bacdb5">
<p>
The templates have been simplified.
</p>

<p>
Some templates supported some very specific use cases, such as deploying a CLI on NPM. This is no longer the case and
the focus for the official templates from now on will be to support the recommended setup (ie. the OCaml Platform)
only.
</p>

<p>
Part of this simplification is also achieved by dropping the support for Reason and Esy. The previous templates will
be available at (<a href="https://github.com/ocaml-templates">https://github.com/ocaml-templates</a>) with the <code>reason-</code> prefix.
</p>

<p>
I've extracted them already, but they will need some reworking before they are usable again.
</p>
</div>
</div>

<div id="outline-container-orgb459dd2" class="outline-4">
<h4 id="orgb459dd2">Better prompts</h4>
<div class="outline-text-4" id="text-orgb459dd2">
<p>
The interactive prompts have been improved through a complete rewrite of
<a href="https://github.com/tmattio/inquire"><code>inquire</code></a>, the prompt library used in Spin.
</p>

<p>
I've tried to test the new prompts as much as possible, but if you encounter an issue with them, don't hesitate to
open an issue on Spin or Inquire.
</p>
</div>
</div>

<div id="outline-container-org6670c5b" class="outline-4">
<h4 id="org6670c5b">Dream template</h4>
<div class="outline-text-4" id="text-org6670c5b">
<p>
Not really part of this release, because this is a community template, but I have been working on a template for
Dream, the new kid OCaml web framework scene, by @aantron.
</p>

<p>
To try it, you can run: <code>opam spin new https://github.com/ocaml-templates/spin-dream</code>.
</p>

<p>
It comes with a modern setup, including:
</p>

<ul class="org-ul">
<li>TailwindCSS integrated with Dune</li>
<li>Inter fonts</li>
<li>Live reloading on file system change</li>
<li>Turbolink setup</li>
</ul>

<p>
It's a bit heavy for my taste at the moment, so I will work on making most of the features optionnal, but if you're
looking to start a new Dream app quickly, this might be useful.
</p>
</div>
</div>

<div id="outline-container-org68a6f51" class="outline-4">
<h4 id="org68a6f51">Changelog</h4>
<div class="outline-text-4" id="text-org68a6f51">
<p>
Here's the complete Changelog.
</p>
</div>

<div id="outline-container-orgcb1b810" class="outline-5">
<h5 id="orgcb1b810">Added</h5>
<div class="outline-text-5" id="text-orgcb1b810">
<ul class="org-ul">
<li>Added an <code>hello</code> command to generate a tutorial project</li>
<li>Added a <code>parse_binaries</code> stanza that can be <code>true</code> to force Spin to parse binary files</li>
<li>Added a <code>raw_files</code> stanza that takes a list of file or glob expressions to instruct Spin to copy files instead of parsing them</li>
<li>Added a new <code>c-bindings</code> template for C bindings using <code>ctypes</code></li>
<li>Added a new <code>js</code> template for javascript applications with <code>js_of_ocaml</code></li>
</ul>
</div>
</div>

<div id="outline-container-org44675cb" class="outline-5">
<h5 id="org44675cb">Changed</h5>
<div class="outline-text-5" id="text-org44675cb">
<ul class="org-ul">
<li>Removed the <code>gen</code> subcommand. The generators will come back with a much better workflow</li>
<li>Dropped support for Esy and Reason. The templates are now using the recommended OCaml setup only. The previous templates are hosted at <a href="https://github.com/ocaml-templates/">https://github.com/ocaml-templates/</a></li>
<li>Changed the templates to use the <code>ISC</code> license</li>
<li>Increase version of <code>ocamlformat</code> to <code>0.18.0</code> in templates</li>
<li>Do not install merlin when installing dev dependencies in templates</li>
<li>Drop support for BuckleScript in PPX</li>
<li>Drop support for publishing on NPM for CLI and PPX templates</li>
<li>Update CI scripts to <code>ocaml/setup-ocaml@v2</code></li>
<li>Remove python dependency to serve documentation in Makefile</li>
<li>Inline release script in Makefile</li>
<li>Remove global <code>-open StdLabels</code> in templates</li>
<li>The <code>spa</code> template has been removed from the official templates and now lives at <a href="https://github.com/ocaml-templates/spin-incr-dom">https://github.com/ocaml-templates/spin-incr-dom</a></li>
<li>Spin does not parse binary files by default anymore, they are simply copied to the destination folder</li>
<li>Use <code>test</code> stanza for unit tests now that Alcotest prints colors by default</li>
<li>Remove unused flags defined in the root's <code>dune</code> file</li>
</ul>
</div>
</div>

<div id="outline-container-orgf1ba36e" class="outline-5">
<h5 id="orgf1ba36e">Fixes</h5>
<div class="outline-text-5" id="text-orgf1ba36e">
<ul class="org-ul">
<li>The project generation will now fail before the configurations prompt if the output directory is not empty</li>
<li>By default, Spin now creates a local switch for the generated projects. This can be changed with <code>spin config</code>, or by setting the env variable <code>SPIN_CREATE_SWITCH=false</code></li>
<li>Fix an CLI incompatibility between <code>opam.2.0.X</code> and <code>opam.2.1.X</code> that made Spin unusable with the former.</li>
</ul>

<p>
I'm also taking the occasion to mention that I am looking for a co-maintainer. If you're interested in improving
OCaml tooling and think Spin is a good addition to OCamlers' toolchain, please DM me :)
</p>
</div>
</div>
</div>
</div>
</div>




<div id="outline-container-10" class="outline-2">
<h2 id="10">vec 0.3.0</h2>
<div class="outline-text-2" id="text-10">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-vec-0-3-0/7971/1">https://discuss.ocaml.org/t/ann-vec-0-3-0/7971/1</a>
</p>
</div>
