2021.06.08.org
** Alex Ionescu announced


I’ve just released version ~0.3.0~ of ~vec~ , a library for safe dynamic arrays with Rust-like mutability
permissions.

You can find the package on opam [[https://opam.ocaml.org/packages/vec/][here]], and the source repository
[[https://github.com/aionescu/vec][here]].

Based on recent feedback, I've revised the API to have more consistent permissions, following some simple rules:

- *Reading* basic properties (~length~, ~capacity~, ~growth_rate~) requires no permissions
- Operations that return or indirectly give access to the vector's elements (i.e. by passing them to a user-provided function) require *read* permission
- Operations that mutate the vector's state (including modifying its elements, resizing its buffer or modifying growth rate) require *write* permission

I've also added some new APIs for inserting and removing elements at arbitrary indexes, and reworked how
~ensure_capacity~ works: Now ~ensure_capacity n v~ ensures that ~v~'s buffer has at least ~n~ free slots.

Please let me know if you have any feedback or suggestions!
      



* First release of line_oriented
:PROPERTIES:
:CUSTOM_ID: 11
:END:
Archive: https://discuss.ocaml.org/t/ann-first-release-of-line-oriented/7977/1

** UnixJunkie announced


A very small library to treat files with lines of text like string lists.
https://github.com/UnixJunkie/line-oriented

The interface is here:
https://github.com/UnixJunkie/line-oriented/blob/main/src/line_oriented.mli

To get it:
#+begin_example
opam install line_oriented
#+end_example
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
