2021.06.08.html

<div id="outline-container-org7c58771" class="outline-3">
<h3 id="org7c58771">Alex Ionescu announced</h3>
<div class="outline-text-3" id="text-org7c58771">
<p>
I’ve just released version <code>0.3.0</code> of <code>vec</code> , a library for safe dynamic arrays with Rust-like mutability
permissions.
</p>

<p>
You can find the package on opam <a href="https://opam.ocaml.org/packages/vec/">here</a>, and the source repository
<a href="https://github.com/aionescu/vec">here</a>.
</p>

<p>
Based on recent feedback, I've revised the API to have more consistent permissions, following some simple rules:
</p>

<ul class="org-ul">
<li><b>Reading</b> basic properties (<code>length</code>, <code>capacity</code>, <code>growth_rate</code>) requires no permissions</li>
<li>Operations that return or indirectly give access to the vector's elements (i.e. by passing them to a user-provided function) require <b>read</b> permission</li>
<li>Operations that mutate the vector's state (including modifying its elements, resizing its buffer or modifying growth rate) require <b>write</b> permission</li>
</ul>

<p>
I've also added some new APIs for inserting and removing elements at arbitrary indexes, and reworked how
<code>ensure_capacity</code> works: Now <code>ensure_capacity n v</code> ensures that <code>v</code>'s buffer has at least <code>n</code> free slots.
</p>

<p>
Please let me know if you have any feedback or suggestions!
</p>
</div>
</div>
</div>




<div id="outline-container-11" class="outline-2">
<h2 id="11">First release of line_oriented</h2>
<div class="outline-text-2" id="text-11">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-release-of-line-oriented/7977/1">https://discuss.ocaml.org/t/ann-first-release-of-line-oriented/7977/1</a>
</p>
</div>

<div id="outline-container-org653bf62" class="outline-3">
<h3 id="org653bf62">UnixJunkie announced</h3>
<div class="outline-text-3" id="text-org653bf62">
<p>
A very small library to treat files with lines of text like string lists.
<a href="https://github.com/UnixJunkie/line-oriented">https://github.com/UnixJunkie/line-oriented</a>
</p>

<p>
The interface is here:
<a href="https://github.com/UnixJunkie/line-oriented/blob/main/src/line_oriented.mli">https://github.com/UnixJunkie/line-oriented/blob/main/src/line_oriented.mli</a>
</p>

<p>
To get it:
</p>
<pre class="example" id="org66dc930">
opam install line_oriented
</pre>
</div>
</div>
</div>




<div id="outline-container-org7029f72" class="outline-2">
<h2 id="org7029f72">Old CWN</h2>
<div class="outline-text-2" id="text-org7029f72">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="orgf213924">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
